<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# Querying in notebooks
© ExploreAI Academy

In this exercise, we will query a sample SQLite database file for a retail company called Northwind to gain some insight into their data. Ensure that you have downloaded the database file Northwind.db.

## Learning objectives

By the end of this train, you should:
- Use basic SELECT statements to retrieve specific data from a database.
- Use the WHERE clause to filter data based on certain conditions.
- Combine multiple conditions using logical operators such as AND and OR.
- Use different logical operators to get or exclude specific values in a table, including the use of IN for multiple values.

First, let's load our sample database:

In [15]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [16]:
# Load the Northwind database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///Northwind.db

Here is a view of all of our tables in the database:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/Northwind_ERD.png"  style="width:500px";/>
<br>
<br>
    <em>Figure 1: Northwind ERD</em>
</div>

## Exercise

Run the necessary queries that will provide us with the following information. Compare your queries with the solutions at the end of this notebook.

### Exercise 1

Find the names of all customers from Germany in the Northwind database.

In [17]:
%%sql
SELECT ContactName
FROM Customers
WHERE Country='Germany';

Running query in 'sqlite:///Northwind.db'

+---------------------+
|     ContactName     |
+---------------------+
|     Maria Anders    |
|      Hanna Moos     |
|     Sven Ottlieb    |
|    Peter Franken    |
|    Philip Cramer    |
|    Renate Messner   |
|   Alexander Feuer   |
| Henriette Pfalzheim |
|     Horst Kloss     |
|    Karin Josephs    |
+---------------------+
Truncated to displaylimit of 10.

### Exercise 2


Find all products in the Northwind database that have a unit price greater than 30 and are discontinued. 

Note: The product has been discontinued when the column `Discontinued` is equal to  1.

In [18]:
%%sql
SELECT ProductName
FROM Products
WHERE UnitPrice >30 AND Discontinued=1;

Running query in 'sqlite:///Northwind.db'

+------------------------+
|      ProductName       |
+------------------------+
|    Mishi Kobe Niku     |
|      Alice Mutton      |
|    Rssle Sauerkraut    |
| Thringer Rostbratwurst |
|     Perth Pasties      |
+------------------------+

### Exercise 3


Find the contact names and phone numbers of customers from either 'USA' or 'Canada'.

In [19]:
%%sql
SELECT ContactName, Phone, Country
FROM Customers
WHERE Country='USA'OR Country='Canada';

Running query in 'sqlite:///Northwind.db'

+-------------------+----------------+---------+
|    ContactName    |     Phone      | Country |
+-------------------+----------------+---------+
| Elizabeth Lincoln | (604) 555-4729 |  Canada |
|   Howard Snyder   | (503) 555-7555 |   USA   |
|   Yoshi Latimer   | (503) 555-6874 |   USA   |
|  Yoshi Tannamuri  | (604) 555-3392 |  Canada |
|     John Steel    | (509) 555-7969 |   USA   |
|    Jaime Yorres   | (415) 555-5938 |   USA   |
|    Fran Wilson    | (503) 555-9573 |   USA   |
|   Jean Fresnire   | (514) 555-8054 |  Canada |
|   Rene Phillips   | (907) 555-7584 |   USA   |
|    Paula Wilson   | (505) 555-5939 |   USA   |
+-------------------+----------------+---------+
Truncated to displaylimit of 10.

### Exercise 4

From the 'Orders' table, select all orders that were placed by 'VINET' or 'TOMSP' and were shipped via shipper 1 or 2.

In [20]:
%%sql
SELECT *
FROM Orders
WHERE CustomerID IN ('VINET','TOMSP') AND ShipVia IN (1,2);

Running query in 'sqlite:///Northwind.db'

+---------+------------+------------+---------------------+---------------------+---------------------+---------+---------+---------------------------+--------------------+----------+------------+----------------+-------------+
| OrderID | CustomerID | EmployeeID |      OrderDate      |     RequiredDate    |     ShippedDate     | ShipVia | Freight |          ShipName         |    ShipAddress     | ShipCity | ShipRegion | ShipPostalCode | ShipCountry |
+---------+------------+------------+---------------------+---------------------+---------------------+---------+---------+---------------------------+--------------------+----------+------------+----------------+-------------+
|  10249  |   TOMSP    |     6      | 1996-07-05 00:00:00 | 1996-08-16 00:00:00 | 1996-07-10 00:00:00 |    1    |  11.61  |     Toms Spezialitten     |   Luisenstr. 48    |  Mnster  |    None    |     44087      |   Germany   |
|  10274  |   VINET    |     6      | 1996-08-06 00:00:00 | 1996-09-03 00:00:00 | 1996-08-16 00:00:00 |    1    |   6.01  | Vins et alcools Chevalier | 59 rue de l-Abbaye |  Reims   |    None    |     51100      |    France   |
|  10295  |   VINET    |     2      | 1996-09-02 00:00:00 | 1996-09-30 00:00:00 | 1996-09-10 00:00:00 |    2    |   1.15  | Vins et alcools Chevalier | 59 rue de l-Abbaye |  Reims   |    None    |     51100      |    France   |
|  10438  |   TOMSP    |     3      | 1997-02-06 00:00:00 | 1997-03-06 00:00:00 | 1997-02-14 00:00:00 |    2    |   8.24  |     Toms Spezialitten     |   Luisenstr. 48    |  Mnster  |    None    |     44087      |   Germany   |
|  10446  |   TOMSP    |     6      | 1997-02-14 00:00:00 | 1997-03-14 00:00:00 | 1997-02-19 00:00:00 |    1    |  14.68  |     Toms Spezialitten     |   Luisenstr. 48    |  Mnster  |    None    |     44087      |   Germany   |
|  10548  |   TOMSP    |     3      | 1997-05-26 00:00:00 | 1997-06-23 00:00:00 | 1997-06-02 00:00:00 |    2    |   1.43  |     Toms Spezialitten     |   Luisenstr. 48    |  Mnster  |    None    |     44087      |   Germany   |
|  10608  |   TOMSP    |     4      | 1997-07-23 00:00:00 | 1997-08-20 00:00:00 | 1997-08-01 00:00:00 |    2    |  27.79  |     Toms Spezialitten     |   Luisenstr. 48    |  Mnster  |    None    |     44087      |   Germany   |
|  10737  |   VINET    |     2      | 1997-11-11 00:00:00 | 1997-12-09 00:00:00 | 1997-11-18 00:00:00 |    2    |   7.79  | Vins et alcools Chevalier | 59 rue de l-Abbaye |  Reims   |    None    |     51100      |    France   |
|  10967  |   TOMSP    |     2      | 1998-03-23 00:00:00 | 1998-04-20 00:00:00 | 1998-04-02 00:00:00 |    2    |  62.22  |     Toms Spezialitten     |   Luisenstr. 48    |  Mnster  |    None    |     44087      |   Germany   |
+---------+------------+------------+---------------------+---------------------+---------------------+---------+---------+---------------------------+--------------------+----------+------------+----------------+-------------+

### Challenge question

Find the employees in the Northwind database who are either Sales Representatives or Sales Managers and are based in London.

In [21]:
%%sql
SELECT FirstName, LastName
FROM employees
WHERE Title IN ('Sales Representative','Sales Manager') AND City='London';

Running query in 'sqlite:///Northwind.db'

+-----------+-----------+
| FirstName |  LastName |
+-----------+-----------+
|   Steven  |  Buchanan |
|  Michael  |   Suyama  |
|   Robert  |    King   |
|    Anne   | Dodsworth |
+-----------+-----------+

## Solutions

### Exercise 1

In [22]:
%%sql
SELECT 
    ContactName 
FROM 
    Customers 
WHERE 
    Country = 'Germany';

Running query in 'sqlite:///Northwind.db'

+---------------------+
|     ContactName     |
+---------------------+
|     Maria Anders    |
|      Hanna Moos     |
|     Sven Ottlieb    |
|    Peter Franken    |
|    Philip Cramer    |
|    Renate Messner   |
|   Alexander Feuer   |
| Henriette Pfalzheim |
|     Horst Kloss     |
|    Karin Josephs    |
+---------------------+
Truncated to displaylimit of 10.

### Exercise 2

In [23]:
%%sql

SELECT 
    ProductName, Discontinued
FROM 
    Products 
WHERE 
    UnitPrice > 30 
    AND Discontinued = 1;

Running query in 'sqlite:///Northwind.db'

+------------------------+--------------+
|      ProductName       | Discontinued |
+------------------------+--------------+
|    Mishi Kobe Niku     |      1       |
|      Alice Mutton      |      1       |
|    Rssle Sauerkraut    |      1       |
| Thringer Rostbratwurst |      1       |
|     Perth Pasties      |      1       |
+------------------------+--------------+

### Exercise 3

In [24]:
%%sql

SELECT 
    ContactName, 
    Phone 
FROM 
    Customers 
WHERE 
    Country IN ('USA', 'Canada');

Running query in 'sqlite:///Northwind.db'

+-------------------+----------------+
|    ContactName    |     Phone      |
+-------------------+----------------+
| Elizabeth Lincoln | (604) 555-4729 |
|   Howard Snyder   | (503) 555-7555 |
|   Yoshi Latimer   | (503) 555-6874 |
|  Yoshi Tannamuri  | (604) 555-3392 |
|     John Steel    | (509) 555-7969 |
|    Jaime Yorres   | (415) 555-5938 |
|    Fran Wilson    | (503) 555-9573 |
|   Jean Fresnire   | (514) 555-8054 |
|   Rene Phillips   | (907) 555-7584 |
|    Paula Wilson   | (505) 555-5939 |
+-------------------+----------------+
Truncated to displaylimit of 10.

### Exercise 4

In [25]:
%%sql

SELECT 
    * 
FROM 
    Orders 
WHERE 
    CustomerID IN ('VINET', 'QUICK', 'SUPRD')
    AND ShipVia IN (1,2);

Running query in 'sqlite:///Northwind.db'

+---------+------------+------------+---------------------+---------------------+---------------------+---------+---------+---------------------------+----------------------+-----------+------------+----------------+-------------+
| OrderID | CustomerID | EmployeeID |      OrderDate      |     RequiredDate    |     ShippedDate     | ShipVia | Freight |          ShipName         |     ShipAddress      |  ShipCity | ShipRegion | ShipPostalCode | ShipCountry |
+---------+------------+------------+---------------------+---------------------+---------------------+---------+---------+---------------------------+----------------------+-----------+------------+----------------+-------------+
|  10252  |   SUPRD    |     4      | 1996-07-09 00:00:00 | 1996-08-06 00:00:00 | 1996-07-11 00:00:00 |    2    |   51.3  |       Suprmes dlices      | Boulevard Tirou, 255 | Charleroi |    None    |     B-6000     |   Belgium   |
|  10274  |   VINET    |     6      | 1996-08-06 00:00:00 | 1996-09-03 00:00:00 | 1996-08-16 00:00:00 |    1    |   6.01  | Vins et alcools Chevalier |  59 rue de l-Abbaye  |   Reims   |    None    |     51100      |    France   |
|  10285  |   QUICK    |     1      | 1996-08-20 00:00:00 | 1996-09-17 00:00:00 | 1996-08-26 00:00:00 |    2    |  76.83  |         QUICK-Stop        |   Taucherstrae 10    | Cunewalde |    None    |      1307      |   Germany   |
|  10295  |   VINET    |     2      | 1996-09-02 00:00:00 | 1996-09-30 00:00:00 | 1996-09-10 00:00:00 |    2    |   1.15  | Vins et alcools Chevalier |  59 rue de l-Abbaye  |   Reims   |    None    |     51100      |    France   |
|  10302  |   SUPRD    |     4      | 1996-09-10 00:00:00 | 1996-10-08 00:00:00 | 1996-10-09 00:00:00 |    2    |   6.27  |       Suprmes dlices      | Boulevard Tirou, 255 | Charleroi |    None    |     B-6000     |   Belgium   |
|  10313  |   QUICK    |     2      | 1996-09-24 00:00:00 | 1996-10-22 00:00:00 | 1996-10-04 00:00:00 |    2    |   1.96  |         QUICK-Stop        |   Taucherstrae 10    | Cunewalde |    None    |      1307      |   Germany   |
|  10345  |   QUICK    |     2      | 1996-11-04 00:00:00 | 1996-12-02 00:00:00 | 1996-11-11 00:00:00 |    2    |  249.06 |         QUICK-Stop        |   Taucherstrae 10    | Cunewalde |    None    |      1307      |   Germany   |
|  10361  |   QUICK    |     1      | 1996-11-22 00:00:00 | 1996-12-20 00:00:00 | 1996-12-03 00:00:00 |    2    |  183.17 |         QUICK-Stop        |   Taucherstrae 10    | Cunewalde |    None    |      1307      |   Germany   |
|  10418  |   QUICK    |     4      | 1997-01-17 00:00:00 | 1997-02-14 00:00:00 | 1997-01-24 00:00:00 |    1    |  17.55  |         QUICK-Stop        |   Taucherstrae 10    | Cunewalde |    None    |      1307      |   Germany   |
|  10475  |   SUPRD    |     9      | 1997-03-14 00:00:00 | 1997-04-11 00:00:00 | 1997-04-04 00:00:00 |    1    |  68.52  |       Suprmes dlices      | Boulevard Tirou, 255 | Charleroi |    None    |     B-6000     |   Belgium   |
+---------+------------+------------+---------------------+---------------------+---------------------+---------+---------+---------------------------+----------------------+-----------+------------+----------------+-------------+
Truncated to displaylimit of 10.

### Challenge question

In [26]:
%%sql

SELECT 
    FirstName, 
    LastName 
FROM 
    Employees 
WHERE 
    (Title = 'Sales Representative' OR Title = 'Sales Manager') 
    AND City = 'London';

Running query in 'sqlite:///Northwind.db'

+-----------+-----------+
| FirstName |  LastName |
+-----------+-----------+
|   Steven  |  Buchanan |
|  Michael  |   Suyama  |
|   Robert  |    King   |
|    Anne   | Dodsworth |
+-----------+-----------+

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>